<template>
  <div class="container">
    <div class="text-h4 mt-6">
      Справка
    </div>

    <div>
      <p class="mt-6">
        Сервис предназначен для мониторинга тестовых площадок по проектам, а именно для просмотра следующей информации:
      </p>
      <p class="mt-6">
        <ul>
          <li>список доменов площадки со ссылками</li>
          <li>текущая ветка в git на площадке</li>
          <li>статус задачи в редмайн (если ветка содержит номер задачи)</li>
          <li>адрес сопоставленной площадки retailcrm</li>
          <li>по запросу есть возможность просмотра git status (модифицированных и новых файлов)</li>
          <li>todo: сброс изменений на сервере по запросу</li>
          <li>todo: переключение ветки по запроса</li>
        </ul>
      </p>
    </div>
  </div>
</template>
